{
  "Foundation Models": {
    "Large Language Models (LLMs)": {
      "Agentic Reasoning and Reinforcement Learning": [
        "Designing agentic reasoning and reinforcement learning methods to improve the performance of LLMs.",
        "Exploring how LLMs can iteratively plan, reflect, and act in complex environments through chain-of-thought and self-correction mechanisms.",
        "Integrating reinforcement learning (RLHF, RLAIF) to align LLM outputs with human preferences and task objectives."
      ],
      "Agentic Systems": [
        "Designing agentic systems (single/multi-agent) that can achieve complex tasks.",
        "Building single-agent systems that autonomously decompose goals, use tools, and execute multi-step plans.",
        "Developing multi-agent frameworks for collaboration, negotiation, and emergent problem-solving in open-ended environments."
      ],
      "PEFT and Task Adaptation": [
        "Designing PEFT methods and task-adaptation strategies to adapt LLMs to specific tasks better and more efficiently.",
        "Low-rank adaptation (LoRA), adapter modules, and prompt tuning for parameter-efficient fine-tuning.",
        "Task-specific adaptation for embodied AI, robotics, and domain-specific applications with limited compute."
      ]
    },
    "World Models and Embodied AI": {
      "Spatial Intelligence for Embodied AI": [
        "Constructing a comprehensive World Model for Spatial Intelligence, serving as the cognitive core for Embodied AI (e.g., Autonomous Vehicles).",
        "The system mirrors the current physical world and reasons about its dynamics—enabling agents to predict outcomes and plan actions.",
        "Unifying perception, prediction, and planning within a coherent World Model for safe and intelligent autonomous behavior."
      ],
      "Spatial Breadth — Collaborative Perception": [
        "Collaborative Perception among agents to overcome individual sensing limitations (e.g., occlusions, limited range).",
        "This collective intelligence builds a more complete and robust World Model, ensuring agents maintain accurate 3D understanding.",
        "Addressing challenges in complex, adversarial, or bandwidth-constrained environments through efficient information sharing and fusion."
      ],
      "Temporal Depth — Generative Models and 3D Reconstruction": [
        "Leveraging Generative Models and 3D Gaussian Splatting to empower agents to hallucinate plausible future scenarios.",
        "Recovering 3D geometry from sparse observations for scene completion and understanding.",
        "This predictive capability enables the World Model to simulate potential outcomes, facilitating foresightful planning and decision-making for Embodied AI."
      ]
    }
  },
  "Connected and Autonomous Driving (CAD)": {
    "Vehicular Perception, Learning and Computing": {
      "Collaborative Perception & Learning": [
        "Multi-agent collaborative perception to overcome occlusion and limited sensing in autonomous driving.",
        "Security challenges in collaborative perception, including adversarial attacks and defense mechanisms.",
        "Use of large language/vision models for multi-agent reasoning and decision-making.",
        "Automated fine-tuning of perception models for connected and autonomous vehicles/robots using pseudo labels generated from improved prediction confidence as agents approach objects."
      ],
      "RIS-aided Communications and Computing": [
        "Enhancing vehicular data transmission rates using reflecting surfaces and optimizing wireless channels for moving vehicles.",
        "Task-oriented semantic communications for CAD.",
        "Height-adjustable RIS-assisted V2I communications.",
        "Multi-hop RIS communications and computing."
      ],
      "Vehicular Edge Computing and Computing Power Networks": [
        "UAV-enabled dynamic computing power networks for mission critical task computation.",
        "How to leverage mobile things to build computing power networks.",
        "Crowdsensing-enhanced federated learning: vehicles act as both data collectors and FL clients, enabling region-specific model training and improved perception quality."
      ]
    },
    "Maritime Perception, Communications, and Computing": {
      "Maritime Perception and Control": [
        "Maritime perception dataset construction and model building.",
        "AI and computer vision for intelligent maritime transportation, focusing on perception in challenging waterway scenarios and generative AI for data scarcity.",
        "Maritime navigation, collision avoidance, and control."
      ],
      "Smart Ports": [
        "Vision-based smart docking.",
        "UAV-assisted cargo inspection and docking."
      ]
    }
  },
 
  "Health, Safety, and Human Sensing": {
    "Health Monitoring and Behavioral Detection": {
      "Remote and Multimodal Health Monitoring": [
        "Multimodal outdoor health monitoring for elderly care and public health by integrating physiological, visual, and audio signals.",
        "Outdoor wireless sensing for smart health, leveraging privacy-preserving technologies like RIS and multi-modal sensing to enhance resolution.",
        "Non-invasive blood glucose monitoring using remote photoplethysmography (rPPG)."
      ],
      "Elderly Healthcare Behavioral Detection": [
        "Indoor elderly behavior detection using RIS and millimeter-wave radar for privacy-preserving monitoring and intervention (e.g., smart aging).",
        "Disease-related abnormal behavioral detection and optimal RIS deployment."
      ]
    },
    "Wireless Sensing for Public Safety": {
      "Crime Deterrence": [
        "Security monitoring in public environments to deter crime progress by leveraging controllable vehicles or opportunistic vehicles.",
        "Crime escape by guiding victims to the safe location.",
        "UAV-assisted surveillance for public safety."
      ]
    }
  },
  "Integrated Design of Smart City and Low Altitude Economy (LAE)": {
    "Smart City Facilitates LAE": [
      "Ground resources can be utilized to facilitate the LAE operations.",
      "Ground guiding and control system design for air flight.",
      "SC design for LAE development."
    ],
    "LAE Offers the Over-the-Air Advantage and Opportunity for SC Operations": [
      "OTA mobile things (UAVs) enrich the air relay opportunity.",
      "OTA delivery of multi-dimensional resources upon request.",
      "Help ground traffic control.",
      "Enrich SC’s service dimension: transport people and needs for smart mobility."
    ]
  },
  "Wireless Communication and Networking": {
    "Secure and Robust Wireless Communication": {
      "Signal Processing and Security": [
        "Robust signal processing and secure wireless communication in challenging environments (UAV, 6G, IoT).",
        "Enhancing reliability, secrecy, and efficiency under adversarial and fast-varying conditions."
      ],
      "Low-Power and Backscatter Communication": [
      "WiFi backscatter systems for low-power IoT communication, focusing on modulation, demodulation, and protocol compatibility."
      ],
      "Fast V2I Communications": [
        "RIS cluster formation for collaborative transmissions and receptions.",
        "Layered adaptive MIMO.",
        "Semantic and/or emergent communications."
      ]
    }
    
  },
  "Artificial Intelligence Security and Data Privacy": {
    "Model and Data Protection": {
      "AI Model Intellectual Property Protection": [
        "Secure and robust watermarking for deep neural networks, especially for generative models, aiming for non-intrusive, high-fidelity watermarking."
      ],
      "Privacy-Preserving Data Transactions": [
        "Secure data evaluation and fair transactions in data marketplaces, focusing on privacy-preserving mechanisms for encrypted data and trustless exchanges."
      ]
    }
  }
}
